# [Supprimer la colonne des Index en Python pour Excel](https://www.youtube.com/watch?v=JdYlqKljKOA&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=15)

Date : 14/05/2025

In [1]:
import pandas as pd

In [2]:
tab = pd.read_excel('data/ResetIndex.xlsx')

In [3]:
tab.head()

              Noms  Points Equipes
0   Hèresse Mégane      70   Verte
1    Hilant Edwige      71   Rouge
2      Hochon Paul      58   Rouge
3  Honnête Camille      55   Verte
4     Hoquet Clara      78   Rouge

In [7]:
tab.sample(10).sort_values(by=['Points'], ascending=True).reset_index(drop=True)

                Noms  Points Equipes
0  Océrosse Séverine      53   Verte
1       Lile Maurice      53   Rouge
2         Jet Claire      61   Rouge
3        Mimi Mathis      65   Verte
4        Loupe Sacha      69   Verte
5        Sisse Médhi      69   Bleue
6        Sille Lucie      71   Bleue
7      Hilant Edwige      71   Rouge
8      Sarbaque Anne      72   Verte
9          Mauve Guy      73   Bleue